In [1]:
import pandas as pd

In [3]:
train = pd.read_csv('train_data.csv')

In [4]:
train

       user_id  item_id  rating
0            0        0       1
1            0        1       1
2            0        2       1
3            0        3       1
4            0        4       1
...        ...      ...     ...
28444     2238     1127       1
28445     2238     1920       1
28446     2238     2006       1
28447     2238      428       1
28448     2238     1290       1

[28449 rows x 3 columns]

In [6]:
test = pd.read_csv('test_data.csv')

In [7]:
test

        user_id  item_id
0             0     2158
1             0     2113
2             0     2070
3             0     2026
4             0     1948
...         ...      ...
223895     2238       53
223896     2238       37
223897     2238       27
223898     2238       18
223899     2238       18

[223900 rows x 2 columns]

In [8]:
valid = pd.read_csv('validation_data.csv')

In [9]:
valid

        user_id  item_id  rating
0             0       43       1
1             0     1102       0
2             0      815       0
3             0      739       0
4             0     1637       0
...         ...      ...     ...
223895     2238     1995       0
223896     2238     1642       0
223897     2238      600       0
223898     2238      982       0
223899     2238     2083       0

[223900 rows x 3 columns]

In [16]:
valid.head(50)

    user_id  item_id  rating
0         0       43       1
1         0     1102       0
2         0      815       0
3         0      739       0
4         0     1637       0
5         0     1987       0
6         0     1107       0
7         0      914       0
8         0     1641       0
9         0      841       0
10        0     1583       0
11        0      698       0
12        0      893       0
13        0     1905       0
14        0     1101       0
15        0      188       0
16        0      834       0
17        0     1834       0
18        0      127       0
19        0     1803       0
20        0      866       0
21        0     1687       0
22        0      206       0
23        0     1872       0
24        0     1566       0
25        0      260       0
26        0     1023       0
27        0     1923       0
28        0       78       0
29        0      811       0
30        0     1178       0
31        0      972       0
32        0       53       0
33        0     1645       0
34        0      197       0
35        0      147       0
36        0     2087       0
37        0     1063       0
38        0     1002       0
39        0      776       0
40        0     1921       0
41        0      223       0
42        0      376       0
43        0     1036       0
44        0     1207       0
45        0     1927       0
46        0     1882       0
47        0       98       0
48        0     1272       0
49        0      416       0

In [25]:
valid[(valid['user_id'] == 0) & (valid['rating'] == 1)]

   user_id  item_id  rating
0        0       43       1

In [26]:
valid[(valid['rating'] == 1)]

        user_id  item_id  rating
0             0       43       1
100           1       86       1
200           2       94       1
300           3      106       1
400           4      114       1
...         ...      ...     ...
223400     2234     1093       1
223500     2235     2124       1
223600     2236       56       1
223700     2237      106       1
223800     2238      345       1

[2239 rows x 3 columns]

In [27]:
test = valid[(valid['rating'] == 1)][['user_id', 'item_id']]

        user_id  item_id
0             0       43
100           1       86
200           2       94
300           3      106
400           4      114
...         ...      ...
223400     2234     1093
223500     2235     2124
223600     2236       56
223700     2237      106
223800     2238      345

[2239 rows x 2 columns]